#白面鸮的介绍
PTILOPSIS='''数据资料——【白面鸮】


        白面鸮是博士派遣来绘画群做讨论记录的，作为曾经的数据专员，白面鸮在记录这件事上有着其他人难以匹敌的优势。

        但她所具备的能力可不止于此，潜能的开发将会使她拥有更强大的力量。

        白面鸮表面上如同一个AI，实际上却是因为矿石病造成的假象。在自身的感性思维濒临崩溃之际，白面鸮毅然决然地使用强有力的理性逻辑来维持四分五裂的意识。

        尽管如此，白面鸮依然是一位名副其实的少女。感性的崩溃给她造就的孤独使她即使冒着失去自我的风险也愿意与博士有着更多的往来。

        毕竟她始终相信，即使她被心中的恶魔吞噬失去了理智，身为博士的你也会将她重新指引到正确的道路。'''


#白羽的介绍
GRAY_FEATHER='''数据资料——【灰羽】


        白面鸮身上的羽毛，颜色棕灰，遍布细长纵纹。白面鸮将之作为信物，代表着亲密的象征，到达一定数量即可提升潜能等级。


        [获取方式] 戳一戳，获取概率：10%'''


#潜能的介绍
POTENTIAL='''数据资料——【潜能】


        白面鸮通过对自我探索与突破获得更强大的能力。随着能力的强大，她也试图摆脱自身AI的一面正常表达自身的喜怒哀乐。

        作为矿石病感染患者，白面鸮一直都被其侵扰。矿石病对白面鸮带来的影响，在于对其种族特性产生的效应深化，劫持睡眠信息指令，严重干扰身体基础神经信号传递。

        但是白面鸮认为：“我们不应持完全主观的态度去批判一项客观存在的事物，矿石病也具有一定意义。”

        “每一天我都在思考着，当源石微粒随同血液流淌时，我该如何解析，计算它们的信息。我该如何在它消耗我的有机资源同时，设法换取一些积极而更有意义的东西。”'''


#总的帮助文档
FUNCTION_HELP='''
    【记录帮助】 使用示例：/log help

    【信息查询】 使用示例：/info

    【搜图】 使用示例：/spi、/spa、/spt

    【订阅提醒】 使用示例：/subs on|off

    【查看设定】 使用示例：/潜能、/灰羽、/白面鸮

    【交互动作】 戳一戳

    【当前版本更新记录】 使用示例：/version
    '''


#Log帮助文本
LOG_HELP='''
    【开启记录程式】 使用示例：/log on

    【关闭记录程式】 使用示例：/log off

    【展示所有记录】 使用示例：/log list

    【展示帮助信息】 使用示例：/log help

    【废弃指定记录】 使用示例：/log drop 1

    【查看指定记录】 使用示例：/log see 1

小提示：在记录过程中，如果发送的消息不想被白面鸮记录下来，请在消息最前方加上/告知白面鸮。
    '''


#一般话语
LINES_GENERAL = ['种族特性与病毒效果叠加，导致我在会话中会随时休眠，请不必在意。',
                '......系统进入睡眠模式。',
                '说话方式？这是源石病毒的影响，绝非我觉得有趣才这样做的。',
                '我与赫默博士是在莱茵生命认识的。在某内部项目中，我为她提供了大数据分析和风险评估。',
                '发生错误。',
                '如果是博士感染了矿石病，博士会怎么做呢？',
                '呜~好困......',
                '我每天都要花好长的时间打理羽毛，然而总是还没打理结束就睡着了。',
                '我最近在学习料理，不过料理似乎对于经常犯困的我来说还是太难了',
                '博士，一直盯着女孩子看是会被当成变态哦。',
                '有时真羡慕大家能随意表露喜悦，我这冷漠的样子一般人都会不适应的吧。',
                '赫默博士最近投入新的项目了，我最好不要打扰她。',
                '似乎有心事在困扰着赫默博士，但她拒绝对我倾诉。',
                '最近的医疗会议我都没有被邀请，甚至连会议记录都没有权限查看。',
                '最近那个邪恶的声音经常出现，它的力量似乎越来越强大了。',
                '我昨晚做了个噩梦，梦见罗德岛的大家离我越来越远。',
                '也许那个声音终有一天会将我的理性吞噬。博士,我恳求您，即使我失去了理智，也请博士指引我回归正确的道路。',
                '白面鸮，无论身处何时，无论身处何处，均作为中立因子而存在。',
                '矿石病...我需要在它消耗我的有机资源同时，设法换取一些积极而更有意义的东西。',
                '目前位置，尚未出现两例矿石病具有一样的特性。甚至有一些矿石病难以称呼其为一种病症，因为其带来的负面影响几乎可以忽略不计。',
                '博士似乎对白面鸮很感兴趣...'
                ]

#亲密话语
LINES_CLOSE =   ['白面鸮已收到博士的爱意❤',
                '白面鸮这里天气很好，博士那如何呢？',
                '博士，白面鸮...想你。',
                '博士，约好了哦，等这场骚乱过去，来一次约会旅行吧...',
                '这是我特地给博士做的营养便当，博士请收下。',
                '博士，你会一直在我身边吗？',
                '检测到白面鸮对博士的好感度上升，要跳到下一个事件选项吗？',
                '博士，你读懂了我内心的孤独。',
                '检测到博士上线，白面鸮的情绪指数上升。',
                '每当博士将手放在我头上轻抚的时候，白面鸮都会感到一股特殊的力量。'
                ]